In [1]:
import pandas as pd

people = {
    "first" : ["Noel", "Tiffanie", "Prashant"],
    "last" : ["Ranjit", "Fabian", "Karki"],
    "email" : ["noelranjit@gmail.com", "tiffanie@gmail.com", "peterparker@gmail.com"]
}

df = pd.DataFrame(people)

In [2]:
# Creating a full_name column 
df['full_name'] = df['first'] + ' ' + df['last']
df

      first    last                  email        full_name
0      Noel  Ranjit   noelranjit@gmail.com      Noel Ranjit
1  Tiffanie  Fabian     tiffanie@gmail.com  Tiffanie Fabian
2  Prashant   Karki  peterparker@gmail.com   Prashant Karki

In [7]:
# removing column full name
df.drop(columns = ['full_name'], inplace = True)

In [11]:
# splitting the full name
df['full_name'] = df['first'] + ' ' + df['last']
df['full_name'].str.split(' ')

0        [Noel, Ranjit]
1    [Tiffanie, Fabian]
2     [Prashant, Karki]
Name: full_name, dtype: object

In [12]:
# spliting full name but giving it a better column format
df['full_name'].str.split(' ', expand = True)

          0       1
0      Noel  Ranjit
1  Tiffanie  Fabian
2  Prashant   Karki

In [13]:
# dropping columns first name and last name 
df.drop(columns = ['first', 'last'])

                   email        full_name
0   noelranjit@gmail.com      Noel Ranjit
1     tiffanie@gmail.com  Tiffanie Fabian
2  peterparker@gmail.com   Prashant Karki

In [16]:
# splitting the full_name to first and last name and storing them in the original
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)
df

      first    last                  email        full_name
0      Noel  Ranjit   noelranjit@gmail.com      Noel Ranjit
1  Tiffanie  Fabian     tiffanie@gmail.com  Tiffanie Fabian
2  Prashant   Karki  peterparker@gmail.com   Prashant Karki

In [22]:
# rearranging to first, last, full name and email
cols = list(df.columns)
df = df[cols[0:2] + [cols[3]] + [cols[2]]]
df

      first    last        full_name                  email
0      Noel  Ranjit      Noel Ranjit   noelranjit@gmail.com
1  Tiffanie  Fabian  Tiffanie Fabian     tiffanie@gmail.com
2  Prashant   Karki   Prashant Karki  peterparker@gmail.com

In [37]:
### add a new first name
pd.set_option('display.max_rows', 30)
df.append({'first' : 'Tony'}, ignore_index = True)

      first    last        full_name                  email
0      Noel  Ranjit      Noel Ranjit   noelranjit@gmail.com
1  Tiffanie  Fabian  Tiffanie Fabian     tiffanie@gmail.com
2  Prashant   Karki   Prashant Karki  peterparker@gmail.com
3      Tony     NaN              NaN                    NaN

In [34]:
avengers = {
    'first' : ['Tony', 'Steve'],
    'last' : ['Stark', 'Rogers'],
    'email' : ['iman@avg.com', 'cap@avg.com']
}
df2 = pd.DataFrame(avengers)
df2

   first    last         email
0   Tony   Stark  iman@avg.com
1  Steve  Rogers   cap@avg.com

In [53]:
# adding df2 items to df
df = df.append(df2, ignore_index = True)
df

      first    last        full_name                  email
0      Noel  Ranjit      Noel Ranjit   noelranjit@gmail.com
1  Tiffanie  Fabian  Tiffanie Fabian     tiffanie@gmail.com
2  Prashant   Karki   Prashant Karki  peterparker@gmail.com
3      Tony   Stark              NaN           iman@avg.com
4     Steve  Rogers              NaN            cap@avg.com

In [54]:
# removing rows from df
df = df.drop(index = df[3:5].index)
df
# you can also do df = df.drop(df[3:5.index])

      first    last        full_name                  email
0      Noel  Ranjit      Noel Ranjit   noelranjit@gmail.com
1  Tiffanie  Fabian  Tiffanie Fabian     tiffanie@gmail.com
2  Prashant   Karki   Prashant Karki  peterparker@gmail.com

In [55]:
# removing row containing lastname Karki
filt = df['last'] == 'Karki'
df = df.drop(index = df[filt].index)
df

      first    last        full_name                 email
0      Noel  Ranjit      Noel Ranjit  noelranjit@gmail.com
1  Tiffanie  Fabian  Tiffanie Fabian    tiffanie@gmail.com